tutorials/incompressible/icoFoam/elbow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall-4          
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    velocity-inlet-5 
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    velocity-inlet-6 
    {
        type            fixedValue;
        value           uniform (0 3 0);
    }

    pressure-outlet-7 
    {
        type            zeroGradient;
    }

    wall-8          
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBackPlanes 
    {
        type            empty;
    }
}

// ************************************************************************* //
